Revit 2027 API
FormatStatus Enumeration
 An enumerated type indicating the formatting status of a range of characters in FormattedText
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum FormatStatus
Public Enumeration FormatStatus
public enum class FormatStatus
type FormatStatus
Members
Member name | Value | Description
All | 1 |  All of the characters in the range have the specified format.
Mixed | 2 |  The characters in the format have mixed formatting.
None | 0 |  None of the characters in the range has the specified format.
Remarks
 The character formatting includes
Bold
Italic
Underline
SuperScript
Subscript
All Caps
See Also
Reference
Autodesk.Revit.DB Namespace